{"_id":"arch_H1Buf_FhH","name":"Application Modernization","type":"Solution","status":"Pending","created":"2019-11-25T15:25:32Z","lastModified":"2020-08-14T12:06:12Z","includedArtifacts":[{"globalTOCPosition":"2.1","typeId":"assetartifact_businesschallenge","_id":"art_rJ22ijon8","artifactTypeId":"artifacttype_d1ab4a95-e05f-3882-9f19-6500fc0d3b2b","type":"Business Challenge"},{"globalTOCPosition":"5.1.4","typeId":"assetartifact_architectureoverview_usagescenario","_id":"art_BJxmL7icnr","artifactTypeId":"artifacttype_d118451c-0816-3aa5-8b89-3119feb4168a","type":"Usage Scenario"},{"globalTOCPosition":"5.1.3","typeId":"assetartifact_architectureoverview_itsystem","_id":"art_S1KREdYhB","artifactTypeId":"artifacttype_355f72be-6566-3f48-8b15-c30f671d7c8f","type":"IT System View"},{"globalTOCPosition":"1","typeId":"assetartifact_executivesummary","_id":"art_SyOFVdthB","artifactTypeId":"artifacttype_9edbd406-69fb-3a95-8b2e-58a0974b2710","type":"Overview"}],"industry":[{"name":"Cross-Industry","_id":"industry_cross"}],"technology":[{"name":"Cloud Computing","_id":"technology_cloud"}],"technicalCapability":[],"businessCapability":[],"client":[{"name":"CAC","_id":"client_B1m7mmQ3r"}],"taxonomies":["Unreliable IT","Become more digital","Be more responsive","Project Delivery Time","Reduce business costs","Modernize ways of working"],"template":{"name":"Solution Architecture Template","description":"Default ToC","_id":"template_company_ibm","isGlobalDefaultTemplate":true},"executiveSummary":"<br><font size=\"5\">Application modernization is inevitable</font><br><br>Application modernization is a necessary part of cloud-centric business transformation. Business pressures demand faster time to market. IT economics require greater workload mobility to allow migrations to the cloud, improving operational efficiency and cost reductions.<br><br>The success of a digital transformation depends on the ability of applications to build innovative capabilities and deliver them quickly and to accelerate developer productivity and the adoption of new cloud-native technologies. Containers, Kubernetes, and microservices deliver speed and simplicity and are being adopted rapidly. But, your current estate determines your modernization strategy. Rewriting your entire application estate is a pipe dream, so modernization is inevitable.<br><br>Modernizing your applications provides a few immediate benefits:<br><br><ul><li>&nbsp;&nbsp;&nbsp; Accelerating digital transformation. Application modernization is driven by the need to transform business to build capabilities and deliver them quickly.</li><li>&nbsp;&nbsp;&nbsp; Improving developer productivity. Adopting cloud-native and containerization technology enables self service for developers.</li><li>&nbsp;&nbsp;&nbsp; Improving operational efficiency and standardization. DevOps enablement drives a culture of automation and transformation of operations.</li></ul><br><font size=\"5\">The application modernization journey</font><br><br>What does application modernization mean? To get started on your modernization journey, you must understand the approaches that are right for your inventory and your modernization goals and choose the approach that best fits your needs.<br><div><br></div><div><img style=\"height: 450px; width: 713px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_95bee3feb1a6f4fa.png\"><br></div>Modernization comes in many flavors. To start the application modernization journey, analyze your current application estate and prioritize your modernization goals. You can use IBM Cloud™ Transformation Advisor to analyze and categorize your applications. It provides guidance on the right target application server and the amount of effort that is required to start the modernization journey.<br><br>Several factors determine an application's path through the modernization phases and where it eventually finishes. Among those factors is the number of code changes that are required to move an application to a modern, cloud-ready application server and the business need for future investment in the application. The outcome of the analysis can help you select appropriate modernization patterns.<br><br><ul><li>&nbsp;&nbsp;&nbsp; Move the monolith to cloud.</li></ul><br>&nbsp;&nbsp;&nbsp; Application migration to the cloud is often approached by using the VM-based \"lift and shift\" method. However, because of the rapid and broad adoption of container orchestration on Kubernetes platforms across virtually all cloud providers, containerization is usually the better way to move applications to the cloud. At the highest level, containerize means to get the applications that you have today to run in a container.<br><br>&nbsp;&nbsp;&nbsp; When you containerize an application, you're focused on reducing costs, simplifying operations, and streamlining cloud migration to a common Kubernetes platform, such as Red Hat® OpenShift®. You're also focused on moving toward a single operational model that can be used by both new cloud-native applications and traditional applications. By using the information from Transformation Advisor, you can decide at this phase whether the application can move to a modern, cloud-ready runtime such as IBM® WebSphere® Liberty. Such a move can require code changes and investment from the development team. You can also decide whether the application can move to a container that is based on traditional WebSphere without code changes.<br><br><ul><li>&nbsp;&nbsp;&nbsp; Expose on-premises assets by using APIs.</li></ul><br>&nbsp;&nbsp;&nbsp; APIs enable assets that are difficult to enable for the cloud. By externalizing an application with an API, you allow new applications to use the exposed capability in an accessible way. Typically, this activity involves having an OpenAPI-specified REST interface that allows the interface to be discovered and managed. If you externalize the application early in the modernization lifecycle, you insulate consumers from further modernization activities that are done in pursuit of a complete cloud-native implementation.<br><br><ul><li>&nbsp;&nbsp;&nbsp; Refactor the monolith into macroservices.</li></ul><br>&nbsp;&nbsp;&nbsp; Refactoring means getting serious about the monolithic things and starting to transform them to become cloud native. Refactoring is where you tackle the huge Java™ and JavaScript files and break monoliths into smaller deployable components as suggested by the programming model. These components are not fully independent microservices from an end-to-end delivery perspective. However, by using this approach, you can decouple modernization paths for individual macroservices and enable the Strangler pattern.<br><br><ul><li>&nbsp;&nbsp;&nbsp; Add capabilities as microservices.</li></ul><br>&nbsp;&nbsp;&nbsp; Innovate incrementally and establish success early. Enriching an application with new business function is a great way to realize the value from application modernization for cloud. Your application can consume a wide variety of innovative services that are available in the cloud, such as AI, industry, and domain services.<br><br><ul><li>&nbsp;&nbsp;&nbsp; Strangle the monolith.</li></ul><br>&nbsp;&nbsp;&nbsp; Incrementally withdraw the monolith from service by replacing functions with new implementations.<br><br>An application modernization journey that is container-oriented aligns with the hybrid nature of cloud adoption by large enterprises. It fully supports multicloud deployments that can span private, on-premises clouds and various public clouds by using standard Kubernetes-based container orchestration platforms, such as Red Hat OpenShift.<br><br><font size=\"5\"><br>Modernization solutions</font><br><br>To help you on your cloud journey, IBM introduced new and better experiences on modernization approaches such as the incremental lift-and-shift to cloud-native microservices. You can make the most of your investments without rewriting your entire estate. When you modernize your applications, you can ease your move to the cloud on the full promise of cloud technology. With a cloud-native microservices approach, you can capitalize on the scalability and flexibility that is inherent to cloud. When you modernize your cloud-native applications, they can run concurrently and seamlessly connect with your investments. Barriers that prohibit productivity and integration are removed to create user experiences and develop applications.<br><div><br></div><div><img style=\"height: 534px; width: 837px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_88eec87e0711e269.png\"><br></div><font size=\"5\">IBM Cloud Pak for Applications solutions</font><br><br>IBM Cloud Pak™ for Applications is a full-stack cloud solution. It gives you an open environment where you can quickly build cloud-native applications, modernize or extend your applications, and deploy middleware consistently across clouds.<br><br>IBM Cloud Pak for Applications is portable to run on premises, on public clouds, or in a preintegrated system. It is certified, up-to-date software that secures the entire stack, from hardware to applications. It has a flexible consumption-based licensing model, where you pay for what you use and use the capabilities that you want.<br><br>IBM Cloud Pak for Applications supports your enterprise’s application runtimes and offers instrumental developer tools and modernization toolkits, DevOps, AppOps management, and a self-service portal. IBM Cloud Pak for Applications can speed up the ability to build cloud-native applications by using built-in developer tools and processes, including support for microservices functions and serverless computing. You can use this Cloud Pak to quickly build applications on any cloud. It provides the most straightforward modernization path to the cloud for WebSphere clients, with security, resiliency, and scalability.<br><br>As shown in the diagram, you can customize your modernization strategy with a flexible deployment model and modernization toolkit. You can also gradually move traditional applications to the cloud in a cost-effective way that makes sense for your business. As you modernize your applications, you can use insights to make decisions about what to replatform, repackage, and refactor, which will optimize your resources and costs.<br><div><br></div><div><img style=\"height: 643px; width: 851px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_542cf6b0a1f2d6c3.png\"><br></div><br>You can develop cloud-native applications with containers, common services, developer tools of your choice, and integrated DevOps and use an optimized set of frameworks and runtimes for cloud-native and traditional applications. Accelerate development with governance that is supported by IBM expertise. Examine the application modernization solutions that are provided by IBM Cloud Pak for Applications. The solution is an end-to-end application modernization experience that includes Build, Deploy, and Run phases:<br><br><ul><li><b>Build</b>. When you containerize an application or integration middleware component, you're moving to a common Kubernetes platform such as Red Hat OpenShift and to a single operational model. The model can be used by both new cloud-native applications and traditional applications. IBM Cloud Pak for Applications provides fully tested, secure, and certified application and middleware runtime containers.</li><li><b>Deploy</b>. A key practice for containerization is to make application container images immutable and embrace a deployment and operations approach that is based on replacing running containers with the original image if problems occur. Thus, DevOps deployment automation pipelines are a building block of any containerization solution.</li><li><b>Run</b>. As you move deeper into the container orchestration world of Kubernetes, you find that many of the responsibilities and tasks that are associated with a traditional WebSphere clustered environment are subsumed into the Kubernetes layer and into the common platform services that are provided by OpenShift.</li></ul><br><font size=\"5\">Application replatforming to cloud-ready Liberty containers</font><br><br>Application containerization outcomes are greatly improved when containerization is accompanied by replatforming the application to a modern container-native runtime that is most suitable for cloud environments, such as WebSphere Liberty. Such modern application runtimes allow application containers to be more agile in terms of smaller runtime footprint and faster startup time. They also provide DevOps-oriented server configuration by using simple human-readable files and prebuilt integration points with common operational services such as logging, metrics, metering, health, and security. A few code changes are typically required to move applications from traditional WebSphere to Liberty.<br><br>For an end-to-end scenario that moves an application to the WebSphere Liberty runtime and runs it in Red Hat OpenShift, see Runtime modernization by using WebSphere Liberty.<br><font size=\"5\"><br>Containerizing a traditional WebSphere application for operational modernization</font><br><br>Refactoring enterprise Java applications to WebSphere Liberty and Open Liberty containers is your most strategic option. However, if there is little business need for future investment in the WebSphere application and Transformation Advisor suggests that you need to change the code to move the application to WebSphere Liberty, you can use the container for traditional IBM WebSphere Application Server.<br><br>By repackaging traditional WebSphere or WebSphere Network Deployment (ND) applications into a container, you can modernize traditional WebSphere ND operations and replace manual administration of WebSphere ND cells with automated DevOps pipelines that automate applications deployment and configuration. You can reuse WebSphere automation scripting. If no such automation exists, you can use the configuration migration tools that are provided by IBM Cloud Pak for Applications to capture WebSphere environment configurations. Those tools create a separate DevOps pipeline for each application in the cell that is moved to a traditional WebSphere container.<br><br>For an end-to-end scenario that moves an application to the traditional WebSphere container and runs it in Red Hat OpenShift, see Operational modernization by using traditional WebSphere.<br><br><font size=\"5\">What's next</font><br><br>Now that you understand the concepts and value of modernizing your applications, read more about how you can start your modernization journey.<br><br>&nbsp;&nbsp;&nbsp; Review the Application modernization reference architecture.<br><br>&nbsp;&nbsp;&nbsp; Read about Primerica, Inc. and how they modernized heritage applications on an open hybrid cloud environment, improving life insurance and shifting culture.<br><br>&nbsp;&nbsp;&nbsp; Let IBM experts help you get started with discovery assessments, enablement options, and other services.<br><br><br>","tag":[],"schemaVersion":"1.4","clientName":"CAC","lastModifiedUser":{"_id":"glcraig@us.ibm.com","fullname":"Gary Craig","notesId":"Gary Craig","jobResponsibilities":"Consultant -- Technical Enablement","avatar":"https://w3-services1.w3-969.ibm.com/myw3/unified-profile-photo/v1/image/glcraig@us.ibm.com?def=avatar","privacyConstent":{"isAccept":true,"country":"US","acceptedDate":"2017-12-29T13:49:15.365Z"},"lastLoginDate":"2020-08-14T11:59:27.672Z","bookmarkedArchList":["copied_e46c1250_ad56_11e7_9df4_2b1f6b893765_COPY_architecture_6ce61071_8d01_11e7_a90b_697746ae2b06","architecture_ce773461_818d_11e7_88e7_21ec9eeb2850","arch_H1XLTgYRz","copied_0050ba20_ad57_11e7_971d_1dbaf50a3a74_COPY_architecture_ab8c2831_a7e8_11e7_8703_cf7fc382471f","architecture_BJpFTNPnQ","arch_SkSV-wOWV","copied_c7d6c370_a427_11e7_9030_55bdb397af46_COPY_architecture_a3903cc1_8db7_11e7_a90b_697746ae2b06","architecture_e7926e01_8ea9_11e7_931e_555f613a0ec4","copied_17e0e030_a428_11e7_b2b8_47a1ea2c680b_COPY_architecture_6dd14e01_8db5_11e7_a90b_697746ae2b06","copied_f5982c40_a427_11e7_9b2d_bf96ebf8b1f3_COPY_architecture_33869491_8dbe_11e7_a90b_697746ae2b06","copied_02fe75c0_a427_11e7_b7a9_bbced10d30d5_COPY_architecture_9abc5771_8d1a_11e7_a90b_697746ae2b06"],"chatbotToken":"f0bdad7fac6c4410845e538772982e3b","username":"glcraig@us.ibm.com","email":"glcraig@us.ibm.com","userPreference":{"defaultTemplate":"template_company_ibm","defaultGithubInfo":{"_id":null,"repoUrl":"git@github.ibm.com:glcraig/CogArch-Archives.git"}},"geographyList":["897"],"businessUnitList":["GLMKT"],"collaborationGroupList":["5b75ceb39ed6be0008efd9fd","5cdd7a31142df200086b2666","5cefa5cad2224300087412ce","5cfe3e84d222430008741419","5d136b3a81dbc100085a295f"]},"owner":{"_id":"glcraig@us.ibm.com","fullname":"Gary Craig","notesId":"Gary Craig","jobResponsibilities":"Consultant -- Technical Enablement","avatar":"https://w3-services1.w3-969.ibm.com/myw3/unified-profile-photo/v1/image/glcraig@us.ibm.com?def=avatar","privacyConstent":{"isAccept":true,"country":"US","acceptedDate":"2017-12-29T13:49:15.365Z"},"lastLoginDate":"2020-08-14T11:59:27.672Z","bookmarkedArchList":["copied_e46c1250_ad56_11e7_9df4_2b1f6b893765_COPY_architecture_6ce61071_8d01_11e7_a90b_697746ae2b06","architecture_ce773461_818d_11e7_88e7_21ec9eeb2850","arch_H1XLTgYRz","copied_0050ba20_ad57_11e7_971d_1dbaf50a3a74_COPY_architecture_ab8c2831_a7e8_11e7_8703_cf7fc382471f","architecture_BJpFTNPnQ","arch_SkSV-wOWV","copied_c7d6c370_a427_11e7_9030_55bdb397af46_COPY_architecture_a3903cc1_8db7_11e7_a90b_697746ae2b06","architecture_e7926e01_8ea9_11e7_931e_555f613a0ec4","copied_17e0e030_a428_11e7_b2b8_47a1ea2c680b_COPY_architecture_6dd14e01_8db5_11e7_a90b_697746ae2b06","copied_f5982c40_a427_11e7_9b2d_bf96ebf8b1f3_COPY_architecture_33869491_8dbe_11e7_a90b_697746ae2b06","copied_02fe75c0_a427_11e7_b7a9_bbced10d30d5_COPY_architecture_9abc5771_8d1a_11e7_a90b_697746ae2b06"],"chatbotToken":"f0bdad7fac6c4410845e538772982e3b","username":"glcraig@us.ibm.com","email":"glcraig@us.ibm.com","userPreference":{"defaultTemplate":"template_company_ibm","defaultGithubInfo":{"_id":null,"repoUrl":"git@github.ibm.com:glcraig/CogArch-Archives.git"}},"collaborationGroupList":["5b75ceb39ed6be0008efd9fd","5cdd7a31142df200086b2666","5cefa5cad2224300087412ce","5cfe3e84d222430008741419","5d136b3a81dbc100085a295f"],"businessUnit":{"_id":"GLMKT","name":"IBM Global Markets","description":""},"geography":{"_id":"897","iot":"North America IOT","imt_market":"US","country":"United States of America"}},"appVersion":"2.9.1"}