{"_id":"arch_ryQGt_CgvfL","name":"Modern Integration Architecture","type":"Solution","status":"Pending","created":"2020-02-04T14:23:44Z","lastModified":"2020-08-03T14:37:28Z","includedArtifacts":[{"globalTOCPosition":"8","typeId":"assetartifact_notes","_id":"art_B1P-vjKfL","artifactTypeId":"artifacttype_02226b19-474e-37a6-ab39-d9bb31767fb5","type":"Notes"},{"globalTOCPosition":"5.1.4","typeId":"assetartifact_architectureoverview_usagescenario","_id":"art_H1lg5QsKMI","artifactTypeId":"artifacttype_d118451c-0816-3aa5-8b89-3119feb4168a","type":"Usage Scenario"},{"globalTOCPosition":"5.1.3","typeId":"assetartifact_architectureoverview_itsystem","_id":"art_SJefBSWwzU","artifactTypeId":"artifacttype_355f72be-6566-3f48-8b15-c30f671d7c8f","type":"IT System View"},{"globalTOCPosition":"1","typeId":"assetartifact_executivesummary","_id":"art_S1C0X-PM8","artifactTypeId":"artifacttype_9edbd406-69fb-3a95-8b2e-58a0974b2710","type":"Overview"}],"industry":[],"technology":[{"name":"Cloud Computing","_id":"technology_cloud"}],"technicalCapability":[],"businessCapability":[],"client":[{"name":"","_id":"client_S1wi6ltRM"}],"taxonomies":["Modernize ways of working","Be more responsive","Integrating apps & data","Project Delivery Time"],"template":{"name":"Solution Architecture Template","description":"Default ToC","_id":"template_company_ibm","isGlobalDefaultTemplate":true},"executiveSummary":"<b><font size=\"5\">Modern integration </font></b><font size=\"5\">(<font size=\"3\">https://www.ibm.com/cloud/architecture/architectures/modern-integration/overview</font>)</font><br><br>IT environments are now fundamentally hybrid and multicloud in nature. Devices, systems, and people are spread across the globe and at the same time virtualized. Achieving integration across this ever-changing environment, providing it at the pace of modern digital initiatives, and still being able to manage the landscape is a significant challenge. Due to the growing need to connect heterogeneous endpoints in various locations, a hybrid multicloud integration platform is crucial.<br><br>Leading-edge enterprises are starting to use a hybrid integration platform to take advantage of the best cloud-based and on-premises integration approaches. Companies that adopt cloud applications view application integration as the critical component to harmonize business processes across their hybrid multicloud applications. Scenarios of hybrid cloud integration include these examples:<br><br><ul><li>Viewing customer information between cloud-based customer relationship management (CRM) systems and on-premises enterprise resource planning (ERP) applications</li><li>Employee data integration between cloud-based human capital management systems and back-office applications</li></ul>The modernized integration reference architecture explores common patterns in enterprises that tackle issues related to a hybrid cloud environment.<br><div><br></div><div><font size=\"5\">The transformation of the hybrid multicloud integration platform</font><br><br>With the advent of container technology and container-orchestration systems for automating application deployment, scaling, and management, the hybrid multicloud integration platform itself is going through a transformation. This transformation introduces characteristics that can increase efficiency, flexibility, and return on investment.<br><br><ul><li>Increase efficiency</li><ul><li>Low code: Employ built-in features, including templates, pre-built connectors, and an asset repository to drive speed in integration development while you reduce cost.</li><li>Agile DevOps: Provide tools to support test-driven development and automated continuous integration continuous delivery (CICD) pipelines.</li><li>Unified management: Provide an integration platform experience where management operations activities are done by using a single interface with visibility into all integration components and AI-assisted augmentation.<br></li></ul><li>Provide flexibility</li><ul><li>Distributed component-based architecture: Support lightweight fine-grained integration services to enable microservices and on-demand runtime application-level composition and aggregation.</li><li>Open: Build on open standards for quick innovation and assured compatibility across a diverse environment.</li><li>Integration patterns: Use a range of integration styles that include APIs, message queues, and emerging capabilities such as event-driven architecture and high-speed data transfer.<br></li></ul><li>Make the most of your investments</li><ul><li>Multicloud: Support integration in an architecture that is built on different cloud services from different cloud vendors and technologies and across many cloud deployment models (public, private, and SaaS). Support traditional integration styles and experiment with a containerized approach across delivery models, domains, endpoints, and personas. Migrate, innovate, and scale at the enterprise’s pace.</li><li>Omni-channel integration endpoints: Integrate applications, data, and services anywhere to support a comprehensive user experience.</li></ul></ul><blockquote><blockquote><img style=\"height: 361px; width: 525px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_65153f99e30b359b.png\"><br></blockquote></blockquote>The modernization of enterprise integration revolves around the concept of “use the old while you embrace the new”. You don't modernize for the sake of modernizing. You transform your current investments and capabilities only when needed to support distinct well-defined business use cases. As those business use cases change and evolve with market fluctuations and shifting competitive winds, the need for speed and responsiveness in transforming enterprise capabilities is crucial.<br><br>For any digital transformation, the concept of a dedicated platform for integration is fundamental. The platform must be ready to quickly implement and assemble various integration patterns that connect the traditional capabilities into the modern architecture in an on-demand, self-service manner.<br><br><font size=\"5\">Moving traditional integration patterns toward modernization</font><br><br>Traditional integration patterns such as gateway services, message queues, file transfer, and enterprise service bus (ESB) still hold a steady role in the enterprise architecture. However, they are all going through an evolution process toward modernization, especially with the prominence of new focus areas such as private cloud and containerization, APIs and microservices, event-driven architecture, and agile integration architecture.<br><br><ul><li>Gateway services evolve toward a single multi-channel gateway form factor. The gateway provides security, control, integration, and optimized access to a wider range of mobile, web, API, service-oriented architecture (SOA), business to business (B2B), and cloud workloads.</li><li>File transfer integration is augmented with high-speed large-file transfer technologies such as IBM Aspera. Aspera provides predictable, reliable, and secure delivery regardless of file size, transfer distance, and network conditions across the WAN.</li><li>Application data integration sees the evolution of the ESB pattern moving from a centralized model toward a more decentralized fine-grained model. That model eventually supports microservices and weaves integration into the agile development process.</li></ul><br><font size=\"5\">Transformation with APIs architecture</font><br><br>Transformation with APIs and API management continues to serve a primordial role in modern integration. However, it is moving beyond the API economy model toward becoming a full-fledged application-centric integration layer.<br><br>An API management platform helps accelerate innovation by making it easier to discover new business assets in current enterprise systems. Existing functionality can be exposed as APIs and published on a self-service portal, which can be used by developers of digital applications who want to consume those APIs. This makes existing enterprise assets available to new channels and to new audiences, with enriched customer experience in integrated omnichannel interactions. It allows for the support of new business models that might not be possible without API adoption. An API management platform provides that layer of controlled and secure self-service access to core business assets.<br><font size=\"5\"><br>Event-driven architecture</font><br><br>Event-driven architecture is a new addition to the publish/subscribe model for integration in the cloud. It uses event-streaming technologies to connect both cloud and on-premises workloads with cloud services and SaaS offerings, especially in AI and analytics.<br><br>When you move to cloud-native architectures with microservices, container-based workloads, and serverless computing, you can revisit event-driven approaches in the cloud-native context. Think of event-driven architectures as extending the resilience, agility, and scalable characteristics of cloud-native architectures to also be reactive and responsive.<br><br><font size=\"5\">Hybrid messaging architecture</font><br><br>Hybrid messaging uses both the point-to-point and publish/subscribe models to process events and triggers from the digital channels. It does this processing by pairing with event-streaming technologies such as Kafka and by playing the enterprise integration role within event-driven architectures.<br><br>In an IT environment that spans both cloud and on-premises systems, those systems must communicate across network boundaries in many scenarios. Hybrid messaging is an approach that enables the seamless communication between those systems.</div><div><br></div><div><font size=\"5\">Changes to your digital ecosystem and core enterprise</font><br><br>At a high level, modern integration involves bridging the capabilities between your digital ecosystem and your traditional core enterprise. The bridging takes place in a seamless, frictionless way so that you can uniformly operate your entire business anytime, anywhere, regardless of technological fluctuations.<br><br>In your digital transformation journeys, your digital ecosystem and your core enterprise constantly change. You need a separate unified integration platform that is both resilient and flexible to serve both as a bridge and a stabilizer, as shown in the diagram.</div><div><br></div><blockquote><div><img style=\"height: 303px; width: 524px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_aa421d5bda183a50.png\"><br></div></blockquote><div><br><ul><li>On your digital enterprise, these changes occur:</li><ul><li>With a microservices design, your integration logic is moving into the applications.</li><li>With IoT channels, your integration must handle the volume and velocity of events and data points in real time.</li><li>With AI, your integration must include cognitive cloud services from multiple cloud vendors.<br></li></ul><li>On your core enterprise, these changes occur:</li><ul><li>With lift-shift cloud migration, your data center is partially on the cloud.</li><li>With SaaS, your System of Record (SOR) capabilities are now on the cloud across multiple vendors.</li><li>With process automation, your integration scope now extends into the entire digital ecosystem.<br></li></ul></ul>A hybrid private cloud that uses open standards and managed container technology presents the optimal platform for modern integration. It addresses hybrid multicloud operations, deployment options, architectural approaches, and integration patterns within a modular and scalable environment.<br><br>As shown in the diagram, the integration platform must accommodate many integration patterns and have that support ready on demand and as a self-service model.<br><br><ul><li> API integration enables synchronous access to fine-grained services, such as create, retrieve, update, and delete operations to business objects across various backends. Thus, the composition of the integration logic on the consumer side.</li><li>Application data integration enables synchronous access to coarse-grained services such as transaction processing across various backends in accordance with enterprise compliance requirements. Thus, the governance of integration logic on the provider side.</li><li>Enterprise messaging enables asynchronous point-to-point access to services such as those that involve closed heritage systems or heterogeneous partner backends.</li><li>Event publish/subscribe integration enables asynchronous many-to-many coordination of services across both cloud and on-premises components in an event-driven architecture context.</li><li>File transfer enables batch integration between SORs that involves the movement of large data files for content across vast physical distances within short time windows.</li></ul><blockquote><img style=\"height: 371px; width: 525px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_86636d81faeb3ad7.png\"></blockquote></div><div>The integration platform must provide a unified framework for security, management operations, and resiliency:<br><br><ul><li>The managed container platform of a private cloud provides resiliency through the elasticity of container clusters and platform-level security.</li><li>The unified management component provides ease of operations with a single view across all integration components within the platform.</li><li>The gateway services provide runtime-level security and enforce access control policies to integration services.</li></ul><br><font size=\"5\">IBM Cloud Pak for Integration</font><br><br>IBM Cloud Pak™ for Integration offers a single, unified platform for all enterprise integration needs. It deploys integration capabilities into the Red Hat® OpenShift® managed container environment. IBM Cloud Pak for Integration uses the monitoring, logging, and security systems of Red Hat OpenShift to ensure consistency across all integration solutions. To get started, see IBM Cloud Pak for Integration (https://www.ibm.com/cloud/cloud-pak-for-integration).<br><br>To help you to decide on the appropriate entry points for your modernization journey, consider these elements that differentiate traditional integration from modern integration:<br><br></div><img style=\"height: 283px; width: 548px;\" src=\"/api/FileManagerAPIs/containers/cafiles/files/file_c8797dfe13fa6e58.png\">","tag":[{"name":"Integration and Development Pattern","_id":"tag_integration_and_dev_pattern"}],"schemaVersion":"1.4","clientName":"","lastModifiedUser":{"_id":"glcraig@us.ibm.com","fullname":"Gary Craig","notesId":"Gary Craig","jobResponsibilities":"Consultant -- Technical Enablement","avatar":"https://w3-services1.w3-969.ibm.com/myw3/unified-profile-photo/v1/image/glcraig@us.ibm.com?def=avatar","privacyConstent":{"isAccept":true,"country":"US","acceptedDate":"2017-12-29T13:49:15.365Z"},"lastLoginDate":"2020-08-03T13:55:54.713Z","bookmarkedArchList":["copied_e46c1250_ad56_11e7_9df4_2b1f6b893765_COPY_architecture_6ce61071_8d01_11e7_a90b_697746ae2b06","architecture_ce773461_818d_11e7_88e7_21ec9eeb2850","arch_H1XLTgYRz","copied_0050ba20_ad57_11e7_971d_1dbaf50a3a74_COPY_architecture_ab8c2831_a7e8_11e7_8703_cf7fc382471f","architecture_BJpFTNPnQ","arch_SkSV-wOWV","copied_c7d6c370_a427_11e7_9030_55bdb397af46_COPY_architecture_a3903cc1_8db7_11e7_a90b_697746ae2b06","architecture_e7926e01_8ea9_11e7_931e_555f613a0ec4","copied_17e0e030_a428_11e7_b2b8_47a1ea2c680b_COPY_architecture_6dd14e01_8db5_11e7_a90b_697746ae2b06","copied_f5982c40_a427_11e7_9b2d_bf96ebf8b1f3_COPY_architecture_33869491_8dbe_11e7_a90b_697746ae2b06","copied_02fe75c0_a427_11e7_b7a9_bbced10d30d5_COPY_architecture_9abc5771_8d1a_11e7_a90b_697746ae2b06"],"chatbotToken":"f0bdad7fac6c4410845e538772982e3b","username":"glcraig@us.ibm.com","email":"glcraig@us.ibm.com","userPreference":{"defaultTemplate":"template_company_ibm","defaultGithubInfo":{"_id":null,"repoUrl":"git@github.ibm.com:glcraig/CogArch-Archives.git"}},"geographyList":["897"],"businessUnitList":["GLMKT"],"collaborationGroupList":["5b75ceb39ed6be0008efd9fd","5cdd7a31142df200086b2666","5cefa5cad2224300087412ce","5cfe3e84d222430008741419","5d136b3a81dbc100085a295f"]},"owner":{"_id":"glcraig@us.ibm.com","fullname":"Gary Craig","notesId":"Gary Craig","jobResponsibilities":"Consultant -- Technical Enablement","avatar":"https://w3-services1.w3-969.ibm.com/myw3/unified-profile-photo/v1/image/glcraig@us.ibm.com?def=avatar","privacyConstent":{"isAccept":true,"country":"US","acceptedDate":"2017-12-29T13:49:15.365Z"},"lastLoginDate":"2020-08-03T13:55:54.713Z","bookmarkedArchList":["copied_e46c1250_ad56_11e7_9df4_2b1f6b893765_COPY_architecture_6ce61071_8d01_11e7_a90b_697746ae2b06","architecture_ce773461_818d_11e7_88e7_21ec9eeb2850","arch_H1XLTgYRz","copied_0050ba20_ad57_11e7_971d_1dbaf50a3a74_COPY_architecture_ab8c2831_a7e8_11e7_8703_cf7fc382471f","architecture_BJpFTNPnQ","arch_SkSV-wOWV","copied_c7d6c370_a427_11e7_9030_55bdb397af46_COPY_architecture_a3903cc1_8db7_11e7_a90b_697746ae2b06","architecture_e7926e01_8ea9_11e7_931e_555f613a0ec4","copied_17e0e030_a428_11e7_b2b8_47a1ea2c680b_COPY_architecture_6dd14e01_8db5_11e7_a90b_697746ae2b06","copied_f5982c40_a427_11e7_9b2d_bf96ebf8b1f3_COPY_architecture_33869491_8dbe_11e7_a90b_697746ae2b06","copied_02fe75c0_a427_11e7_b7a9_bbced10d30d5_COPY_architecture_9abc5771_8d1a_11e7_a90b_697746ae2b06"],"chatbotToken":"f0bdad7fac6c4410845e538772982e3b","username":"glcraig@us.ibm.com","email":"glcraig@us.ibm.com","userPreference":{"defaultTemplate":"template_company_ibm","defaultGithubInfo":{"_id":null,"repoUrl":"git@github.ibm.com:glcraig/CogArch-Archives.git"}},"collaborationGroupList":["5b75ceb39ed6be0008efd9fd","5cdd7a31142df200086b2666","5cefa5cad2224300087412ce","5cfe3e84d222430008741419","5d136b3a81dbc100085a295f"],"businessUnit":{"_id":"GLMKT","name":"IBM Global Markets","description":""},"geography":{"_id":"897","iot":"North America IOT","imt_market":"US","country":"United States of America"}},"appVersion":"2.9.1"}